---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InvalidDBviewScopeBox
source: html/7cb0474b-97b3-3ab6-4de4-243afb5348b7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InvalidDBviewScopeBox Property

The scope box and view must have parallel vertical axes.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidDBviewScopeBox { get; }
```